docs/pages/index2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-01 Wed 10:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Org Publish Setup</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Deric Bytes">
<link rel="stylesheet"
href="css/main.css"
type="text/css"/>
<link rel="stylesheet"
href="css/emacs-org.css"
type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<header id="masthead" class="site-header" itemtype="https://schema.org/WPHeader" itemscope="">
  <div class="inside-header grid-container grid-parent"><div class="site-branding">
      <p class="main-title" itemprop="headline"> <a href="https://www.planetario.net/" rel="home"> Marte </a></p>
      <p class="site-description" itemprop="description"> Información sobre Marte</p>
    </div>
  </div>
</header>
<nav id="site-navigation" class="main-navigation sub-menu-right" itemtype="https://schema.org/SiteNavigationElement" itemscope="">
  <div class="inside-navigation grid-container grid-parent">
    <button class="menu-toggle" aria-controls="primary-menu" aria-expanded="false">
      <span class="mobile-menu">Menú</span> </button><div id="primary-menu" class="main-nav">
      <ul id="menu-primario" class=" menu sf-menu">
	<li id="menu-item-61" class="menu-item menu-item-type-post_type menu-item-object-page menu-item-home menu-item-61">
	  <a href="https://www.planetario.net/">Planetas</a></li>
	<li id="menu-item-457" class="menu-item menu-item-type-post_type menu-item-object-page menu-item-457"><a href="https://www.planetario.net/luna/">Luna</a></li>
	<li id="menu-item-286" class="menu-item menu-item-type-post_type menu-item-object-page menu-item-286"><a href="https://www.planetario.net/constelaciones/">Constelaciones</a></li>
      </ul>
    </div>
  </div>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Org Publish Setup</h1>
</header>
<div id="outline-container-orgb78baba" class="outline-2">
<h2 id="orgb78baba">Convert org file to an html file</h2>
<div class="outline-text-2" id="text-orgb78baba">
<p>
Aqui configuro opciones para publicar aglunos archivos escrito
in formato de org-mode, como paginas web in mi pagina web.
</p>

<p>
He dado el nombre 'falla-conmigo-github' a las opciones associated
con mi reglas de exportar para mi pagina web.
</p>

<p>
<b>:base-directory</b> - los archivos bajo esta carparta son
associated con este projecto.
</p>

<p>
<b>:publishing-directory</b> - el path relativo de archives de
base-directory sera movido, a esta directorio, mantiendo su ruta
relativa.
</p>

<p>
<b>:with-toc</b> - si quieres anadir una tabla de contenido a los archivos exportados
</p>

<p>
<b>:html-postamble</b> - si quieres anadir su propio pie de pagina
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #8b2252;">"falla-conmigo-github"</span>
 <span style="color: #483d8b;">:base-directory</span> <span style="color: #8b2252;">"~/wd/falla-conmigo/docs/org/"</span>
 <span style="color: #483d8b;">:publishing-directory</span> <span style="color: #8b2252;">"~/wd/falla-conmigo/docs"</span>
 <span style="color: #483d8b;">:publishing-function</span> org-html-publish-to-html
 <span style="color: #483d8b;">:section-numbers</span> nil
 <span style="color: #483d8b;">:html-postamble</span> (<span style="color: #a020f0;">lambda</span> (<span style="color: #228b22;">&amp;rest</span> <span style="color: #a0522d;">ignore</span>)
                   (format <span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">     &lt;div class=\"footerDate\"&gt;</span>
<span style="color: #8b2252;">     &lt;p class=\"date\"&gt;</span>
<span style="color: #8b2252;">     Last edit: %s %s</span>
<span style="color: #8b2252;">     &lt;/p&gt;</span>
<span style="color: #8b2252;">     &lt;/div&gt;</span>
<span style="color: #8b2252;">     "</span> (today) (now)))
 <span style="color: #483d8b;">:with-toc</span> nil
 <span style="color: #483d8b;">:html-head</span> <span style="color: #8b2252;">"&lt;link rel=\"stylesheet\"</span>
<span style="color: #8b2252;">     href=\"css/main.css\"</span>
<span style="color: #8b2252;">     type=\"text/css\"/&gt;"</span>)
</pre>
</div>

<p>
Tienes que anadir sus reglas de proyecto a org-publish-project-alist
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a020f0;">setq</span> org-publish-project-alist
      '<span style="color: #008b8b;">((</span><span style="color: #8b2252;">"falla-conmigo-github"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:base-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/wd/falla-conmigo/docs/org/"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/wd/falla-conmigo/docs"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-function</span><span style="color: #008b8b;"> org-html-publish-to-html</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:section-numbers</span><span style="color: #008b8b;"> nil</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:html-postamble</span><span style="color: #008b8b;"> (</span><span style="color: #a020f0;">lambda</span><span style="color: #008b8b;"> (</span><span style="color: #228b22;">&amp;rest</span><span style="color: #008b8b;"> </span><span style="color: #a0522d;">ignore</span><span style="color: #008b8b;">)</span>
<span style="color: #008b8b;">                           (format </span><span style="color: #8b2252;">"</span>
<span style="color: #8b2252;">  &lt;div class=\"footerDate\"&gt;</span>
<span style="color: #8b2252;">  &lt;p class=\"date\"&gt;</span>
<span style="color: #8b2252;">  Last edit: %s %s</span>
<span style="color: #8b2252;">  &lt;/p&gt;</span>
<span style="color: #8b2252;">  &lt;/div&gt;</span>
<span style="color: #8b2252;">  "</span><span style="color: #008b8b;"> (today) (now)))</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:with-toc</span><span style="color: #008b8b;"> nil</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:html-head</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"&lt;link rel=\"stylesheet\"</span>
<span style="color: #8b2252;">  href=\"css/main.css\"</span>
<span style="color: #8b2252;">  type=\"text/css\"/&gt;"</span><span style="color: #008b8b;">)</span>
<span style="color: #008b8b;">        (</span><span style="color: #8b2252;">"html"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:base-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/org/"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:base-extension</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"org"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/org/exports"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-function</span><span style="color: #008b8b;"> org-publish-org-to-html)</span>
<span style="color: #008b8b;">        (</span><span style="color: #8b2252;">"pdf"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:base-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/org/"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:base-extension</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"org"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-directory</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"~/org/exports"</span>
<span style="color: #008b8b;">         </span><span style="color: #483d8b;">:publishing-function</span><span style="color: #008b8b;"> org-publish-org-to-pdf)</span>
<span style="color: #008b8b;">        (</span><span style="color: #8b2252;">"all"</span><span style="color: #008b8b;"> </span><span style="color: #483d8b;">:components</span><span style="color: #008b8b;"> (</span><span style="color: #8b2252;">"html"</span><span style="color: #008b8b;"> </span><span style="color: #8b2252;">"pdf"</span><span style="color: #008b8b;">)))</span>)
</pre>
</div>

<p>
puedes publicar el buffer actual usando
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x org-publish-current-file
</pre>
</div>

<p>
puedes publicar el proyecto entero usando
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x org-publish-project RET falla-conmigo-github
</pre>
</div>


<p>
Tambien ver:
</p>
<ul class="org-ul">
<li>org-export-dispatch - selectionar que methodo a usar para
convertir el buffer</li>
<li>org-html-export-as-html - convertir buffer a html y mostrar en
nuevo buffer</li>
<li>org-html-export-to-html - convertir buffer a html y escribir a un
archive de .html con la misma nomber in la misma directorio</li>
</ul>

<p>
Artículos que leí:
</p>
<ul class="org-ul">
<li><a href="https://gist.github.com/dashohoxha/5981222">web: gist.github.com - Dashohoxha: 5981222</a></li>
<li><a href="https://stackoverflow.com/questions/9559753/emacs-org-mode-export-to-another-directory">stackoverflow: Emacs Org-mode - Export to another directory?</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgdc9d26b" class="outline-2">
<h2 id="orgdc9d26b">css</h2>
<div class="outline-text-2" id="text-orgdc9d26b">
<p>
<a href="https://orgmode.org/manual/CSS-support.html">Official Docs: Css</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<div class="footerDate">
<p class="date">
Last edit: 2021/09/01 10:04:41
</p>
</div>
</div>
</body>
</html>
